"""
각 자리가 숫자(0부터 9)로만 이루어진 문자열 S가 주어졌을 때, 
왼쪽부터 오른쪽으로 하나씩 모든 숫자를 확인하며 
숫자 사이에 'x' 혹은 '+' 연산자를 넣어 
결과적으로 만들어질 수 있는 가장 큰 수를 구하는 프로그램을 작성하세요. 
단, +보다 x를 먼저 계산하는 일반적인 방식과는 달리, 
모든 연산은 왼쪽에서부터 순서대로 이루어진다고 가정합니다.

예를 들어 02984라는 문자열이 주어지면, 
만들어질 수 있는 가장 큰 수는 ((((0+2)x9)x8)x4) = 576입니다. 
또한 만들어질 수 있는 가장 큰 수는 
항상 20억 이하의 정수가 되도록 입력이 주어집니다.

입력
첫째 줄에 여러 개의 숫자로 구성된 하나의 문자열 S가 주어집니다.
(1<=S의 길이<=20)
출력
첫째 줄에 만들어질 수 있는 가장 큰 수를 출력합니다.
"""

def solution(S: str):
    L = len(S)
    if L==1:
        return int(S)  
    
    result = int(S[0])
    for i in range(L-1): # i = 0 ~ L-2
        num = int(S[i+1]) # S[i+1] = S[1] ~ S[L-1]
        if (result >= 2) & (num >= 2):
            result *= num
        else:
            result += num
    return result
        
    
    
print(solution("0123")) # 9
print(solution("1")) # 1
print(solution("1001")) # 9
print(solution("1001321")) # 9



